In [1]:
# Pandas is a library for basic data analysis
import pandas as pd

# NumPy is a library for advanced mathematical computation
import numpy as np

# MatPlotLib is a library for basic data visualization
import matplotlib.pyplot as plt

# SeaBorn is a library for advanced data visualization
import seaborn as sns

In [13]:
adf = pd.DataFrame(data={'x1': ['A', 'B', 'D'], 'x2' : [1, 2, 3]})

In [12]:
bdf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x3' : ['T', 'F', 'T']})

In [7]:
pd.merge(adf,bdf,how='left')

  x1  x2   x3
0  A   1    T
1  C   2  NaN
2  D   3    T

In [14]:
pd.merge(adf,bdf,how='inner')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [15]:
pd.merge(adf,bdf,how='outer')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  D  3.0  NaN
3  C  NaN    T

In [16]:
pd.concat([adf,bdf],sort=True)

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  D  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  C  NaN    T

In [17]:
pd.concat([adf,bdf],axis=1)

  x1  x2 x1 x3
0  A   1  A  T
1  B   2  B  F
2  D   3  C  T

In [19]:
ndf = pd.concat([adf,bdf],ignore_index=True)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [20]:
ndf

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  D  3.0  NaN
3  A  NaN    T
4  B  NaN    F
5  C  NaN    T

In [22]:
ddf = pd.DataFrame([[1,3],[3,4]], columns = ['a','b'])

In [24]:
ddd = pd.DataFrame([[5,6],[7,8]], columns = ['a','b'])

In [25]:
ddf

   a  b
0  1  3
1  3  4

In [26]:
ddd

   a  b
0  5  6
1  7  8

In [27]:
ddf2 = pd.DataFrame({'a': [1,10,8,11,-1],'b': list('abdce'),'c':[1.0,2.0,np.nan,3.0,4.6]})

In [28]:
ddf2.nlargest(3,'a')

    a  b    c
3  11  c  3.0
1  10  b  2.0
2   8  d  NaN

In [29]:
ddf2.isnull().sum()

a    0
b    0
c    1
dtype: int64

In [30]:
ddf2

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.6

In [33]:
data = {'weekday': ["Monday, Happy Days", "Tuesday", "Wednesday, Happy Days", 
         "Thursday", "Friday, Happy Days", "The weekend comes, my cycle hums, ready to race to you!", "Sunday"],
        'Person 1': [12, 6, 5, 8, 11, 6, 4],
        'Person 2': [10, 6, 11, 5, 8, 9, 12],
        'Person 3': [8, 5, 7, 3, 7, 11, 15]}
df = pd.DataFrame(data, columns=['weekday',
        'Person 1', 'Person 2', 'Person 3'])

In [34]:
df

,weekday,Person 1,Person 2,Person 3
0,"Monday, Happy Days",12,10,8
1,Tuesday,6,6,5
2,"Wednesday, Happy Days",5,11,7
3,Thursday,8,5,3
4,"Friday, Happy Days",11,8,7
5,"The weekend comes, my cycle hums, ready to rac...",6,9,11
6,Sunday,4,12,15